app/controllers/campsites_controller.rb

SELECT "campsites".* FROM "campsites"
---
  def index
    @campsites = Campsite.all

SELECT  "campsites".* FROM "campsites" WHERE "campsites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @campsite = Campsite.find(params[:id])

INSERT INTO "campsites" ("name", "owner", "description") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jame's fun time camp"], ["owner", "Tim"], ["description", "GOOD TIMES"]]
---
  def create
    @campsite = Campsite.new(campsite_params)
    if @campsite.save