app/controllers/villagers_controller.rb

  def new
    @villager = Villager.new
    @campsite = Campsite.find(params[:campsite_id])
---
SELECT  "campsites".* FROM "campsites" WHERE "campsites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @campsite = Campsite.find(params[:campsite_id])
    @villager = Villager.new(villager_params)
    @villager.campsite = @campsite
    if @villager.save
---
SELECT  "campsites".* FROM "campsites" WHERE "campsites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "villagers" ("name", "animal", "happiness", "campsite_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "steven"], ["animal", "moose"], ["happiness", 7], ["campsite_id", 1], ["created_at", "2017-11-30 23:34:11.259114"], ["updated_at", "2017-11-30 23:34:11.259114"]]